Belief997/lab-Micro_power_consumption_backscatter/SDK_2.3.1_MKL03Z32xxx4/boards/frdmkl03z/demo_apps/power_mode_switch/power_mode_switch.c
    }

//    GPIO_PortToggle(GPIOA, 1u << 5U);
//    GPIO_PortToggle(GPIOB, 1u << 3U);
    /* Set conversionCompleted flag. This prevents an wrong conversion in main function */
    conversionCompleted = true;
/* Add for ARM errata 838869, affects Cortex-M4, Cortex-M4F Store immediate overlapping
  exception return operation might vector to incorrect interrupt */
#if defined __CORTEX_M && (__CORTEX_M == 4U)
    __DSB();
#endif
}


/*!
 * @brief main function
 */

#define DEMO_LPTMR_IRQn LPTMR0_IRQn
#define LPTMR_LED_HANDLER LPTMR0_IRQHandler
volatile u8 dataBuf[SENSOR_DATA_LEN];

volatile u8 status = STATUS_WAIT_TRIG;
volatile u8 status_rec = REC_WAIT;
volatile u8 status_send = SEND_WAIT;

void LPTMR_LED_HANDLER(void)
//void LPTMR0_IRQHandler(void)
{
    LPTMR_ClearStatusFlags(DEMO_LPTMR_BASE, kLPTMR_TimerCompareFlag);

    // debug
//    GPIO_PortToggle(GPIOB, 1u << 3U);
//    char debug_buf[6]={0x1, 0x2, 0x3, 0x4, 0x5, 0x6};
    if(STATUS_WAIT_SEND == status)
    {
    	static u8 cnt_bit = 0;
    	static u8 cnt_byte = 0;
    	static u8 checkSum = 0;
    	static u8 islastBit = FALSE;

    	do{
			if(islastBit)
			{
				islastBit = FALSE;
				GPIO_PinWrite(GPIOB, 3U, 0);
				status_send = SEND_SUCCESS;
				break;
			}

			if(cnt_byte < SENSOR_HEADER_LEN)
			{
				GPIO_PinWrite(GPIOB, 3U, SENSOR_HEADER & (0x80 >> cnt_bit));
				checkSum = 0;
			}
			else if(cnt_byte < SENSOR_HEADER_LEN + SENSOR_DATA_LEN)
			{
	    		GPIO_PinWrite(GPIOB, 3U, dataBuf[cnt_byte - SENSOR_HEADER_LEN] & (0x80 >> cnt_bit));
//				GPIO_PinWrite(GPIOB, 3U, debug_buf[cnt_byte - SENSOR_HEADER_LEN] & (0x80 >> cnt_bit));
				if(!cnt_bit)
				{
	    			checkSum += dataBuf[cnt_byte - SENSOR_HEADER_LEN];
//					checkSum += debug_buf[cnt_byte - SENSOR_HEADER_LEN];
				}
			}
			else
			{
				GPIO_PinWrite(GPIOB, 3U, checkSum & (0x80 >> cnt_bit));
			}

			cnt_byte = (cnt_bit == 7)? (cnt_byte + 1) % SENSOR_FRAME_LEN : cnt_byte;
			cnt_bit =  (cnt_bit + 1) % 8;

			if(0 == cnt_bit && 0 == cnt_byte)
			{
				islastBit = TRUE;
			}
			else
			{
				status_send = SEND_WAIT;
			}
			break;
    	}while(1);
    }


    /*
     * Workaround for TWR-KV58: because write buffer is enabled, adding
     * memory barrier instructions to make sure clearing interrupt flag completed
     * before go out ISR
     */
    __DSB();
    __ISB();
}


lpuart_handle_t g_lpuartHandle;
uint8_t g_tipString[] = "LPUART RX ring buffer example\r\nSend back received data\r\nEcho every 8 types\r\n";
uint8_t g_rxRingBuffer[RX_RING_BUFFER_SIZE] = {0}; /* RX ring buffer. */

extern uint8_t g_rxBuffer[ECHO_BUFFER_SIZE]; /* Buffer for receive data to echo. */
extern uint8_t g_txBuffer[ECHO_BUFFER_SIZE]; /* Buffer for send data to echo. */
extern volatile bool rxBufferEmpty;
extern volatile bool txBufferFull;
extern volatile bool txOnGoing;
extern volatile bool rxOnGoing;


#define USER_PWM_NUM  1
#define WAKEUP_ENABLE 0

#include "string.h"
void user_showFreq(void)
{
//	PRINTF("\r\n--------------------------\r\n");
//    PRINTF("kCLOCK_CoreSysClk %d.\r\n", CLOCK_GetFreq(kCLOCK_CoreSysClk));
//    PRINTF("kCLOCK_PlatClk %d.\r\n", CLOCK_GetFreq(kCLOCK_PlatClk));
//    PRINTF("kCLOCK_BusClk %d.\r\n", CLOCK_GetFreq(kCLOCK_BusClk));
//    PRINTF("kCLOCK_FlashClk %d.\r\n", CLOCK_GetFreq(kCLOCK_FlashClk));
//    PRINTF("kCLOCK_Er32kClk %d.\r\n", CLOCK_GetFreq(kCLOCK_Er32kClk));
//    PRINTF("kCLOCK_Osc0ErClk %d.\r\n", CLOCK_GetFreq(kCLOCK_Osc0ErClk));
//    PRINTF("kCLOCK_McgInternalRefClk %d.\r\n", CLOCK_GetFreq(kCLOCK_McgInternalRefClk));
//    PRINTF("kCLOCK_McgPeriphClk %d.\r\n", CLOCK_GetFreq(kCLOCK_McgPeriphClk));
//    PRINTF("kCLOCK_McgIrc48MClk %d.\r\n", CLOCK_GetFreq(kCLOCK_McgIrc48MClk));
//    PRINTF("kCLOCK_LpoClk %d.\r\n", CLOCK_GetFreq(kCLOCK_LpoClk));


	// 2M kCLOCK_CoreSysClk
	// 2M kCLOCK_McgInternalRefClk
	// 0  kCLOCK_McgPeriphClk
    u32 freq = CLOCK_GetFreq(kCLOCK_CoreSysClk);
    char buf[32] = "\0";

    sprintf(buf, "%d\n", freq);


    /* Send g_tipString out. */
    lpuart_transfer_t xfer;
    xfer.data = buf;
    xfer.dataSize = strlen(buf);
    txOnGoing = true;
    LPUART_TransferSendNonBlocking(DEMO_LPUART, &g_lpuartHandle, &xfer);

    /* Wait send finished */
    while (txOnGoing)
    {
    }

}


void user_timerInit(void)
{
	lptmr_config_t lptmrUserConfig;

	LPTMR_GetDefaultConfig(&lptmrUserConfig);
	/* Init LPTimer driver */
	LPTMR_Init(DEMO_LPTMR_BASE, &lptmrUserConfig);

	/* Set the LPTimer period */
	LPTMR_SetTimerPeriod(DEMO_LPTMR_BASE, LPTMR_COMPARE_VALUE);

	/* Enable timer interrupt */
	LPTMR_EnableInterrupts(DEMO_LPTMR_BASE, kLPTMR_TimerInterruptEnable);

	/* Enable at the NVIC */
	EnableIRQ(DEMO_LPTMR_IRQn);
	LPTMR_StartTimer(DEMO_LPTMR_BASE);
}
void user_pwmInit(void)
{
	#ifndef TPM_LED_ON_LEVEL

	#define TPM_LED_ON_LEVEL kTPM_LowTrue
	#endif
	#if USER_PWM_NUM == 1
		tpm_config_t tpmInfo;
		tpm_chnl_pwm_signal_param_t tpmParam;

		tpmParam.chnlNumber = (tpm_chnl_t)BOARD_TPM_CHANNEL;
		tpmParam.level = TPM_LED_ON_LEVEL;
		tpmParam.dutyCyclePercent = updatedDutycycle;

	#elif USER_PWM_NUM == 2
		tpm_config_t tpmInfo;
		tpm_chnl_pwm_signal_param_t tpmParam[2];

	#ifndef TPM_LED_ON_LEVEL
		  #define TPM_LED_ON_LEVEL kTPM_LowTrue
	#endif
	#define BOARD_FIRST_TPM_CHANNEL 0U
	#define BOARD_SECOND_TPM_CHANNEL 1U

		tpmParam[0].chnlNumber = (tpm_chnl_t)BOARD_FIRST_TPM_CHANNEL;
		tpmParam[0].level = TPM_LED_ON_LEVEL;
		tpmParam[0].dutyCyclePercent = updatedDutycycle;

		tpmParam[1].chnlNumber = (tpm_chnl_t)BOARD_SECOND_TPM_CHANNEL;
		tpmParam[1].level = TPM_LED_ON_LEVEL;
		tpmParam[1].dutyCyclePercent = updatedDutycycle;

	#else
		#error "pwm num set err!"
	#endif

	/* Select the clock source for the TPM counter as kCLOCK_McgInternalRefClk */
	//    CLOCK_SetTpmClock(1U);
	CLOCK_SetTpmClock(3U);

	TPM_GetDefaultConfig(&tpmInfo);
	/* Initialize TPM module */
	TPM_Init(BOARD_TPM_BASEADDR, &tpmInfo);

	// redefine ch number by micro, set freq divider here
	TPM_SetupPwm(BOARD_TPM_BASEADDR, &tpmParam, USER_PWM_NUM, kTPM_CenterAlignedPwm, 500000U, 2000000); //  2M clock source @VLPR
	TPM_StartTimer(BOARD_TPM_BASEADDR, kTPM_SystemClock);
}

