Belief997/lab-Micro_power_consumption_backscatter/SDK_2.3.1_MKL03Z32xxx4/boards/frdmkl03z/demo_apps/power_mode_switch/power_mode_switch.c
void user_VLPR(smc_power_state_t *pcurPowerState, app_power_mode_t *ptargetPowerMode,  bool *pneedSetWakeup)
{
	*pcurPowerState = SMC_GetPowerModeState(SMC);

//        APP_ShowPowerMode(curPowerState);
//        user_showFreqList();

    // set default powermode as vlpr
    if(*pcurPowerState != kSMC_PowerStateVlpr)
    {
    	*ptargetPowerMode = (app_power_mode_t)kAPP_PowerModeVlpr;
    }
    else
    {
    	*ptargetPowerMode = (app_power_mode_t)kAPP_PowerModeVlpr;
    }
    // A:run, D:vlpr, I:vlls3
//        PRINTF("\r\nTarget %c \r\n", targetPowerMode);

	if ((*ptargetPowerMode > kAPP_PowerModeMin) && (*ptargetPowerMode < kAPP_PowerModeMax))
	{
		/* If could not set the target power mode, loop continue. */
		if (!APP_CheckPowerMode(*pcurPowerState, *ptargetPowerMode))
		{
//				PRINTF("\r\n curPowerState %x \r\n", curPowerState);
//				continue;
//				break;
		}

		/* If target mode is RUN/VLPR/HSRUN, don't need to set wakeup source. */
		if ((kAPP_PowerModeRun == *ptargetPowerMode) || (kAPP_PowerModeVlpr == *ptargetPowerMode))
		{
			*pneedSetWakeup = false;
		}
		else
		{
			*pneedSetWakeup = true;
		}

		if (*pneedSetWakeup)
		{
			APP_GetWakeupConfig(*ptargetPowerMode);
		}

		APP_PowerPreSwitchHook(*pcurPowerState, *ptargetPowerMode);

		if (*pneedSetWakeup)
		{
			APP_SetWakeupConfig(*ptargetPowerMode);
		}

		APP_PowerModeSwitch(*pcurPowerState, *ptargetPowerMode);
		APP_PowerPostSwitchHook(*pcurPowerState, *ptargetPowerMode);
	}

}

void user_gpioInit(void)
{
    gpio_pin_config_t config_output_L = {kGPIO_DigitalOutput, 0};
    gpio_pin_config_t config_output_H = {kGPIO_DigitalOutput, 1};
    gpio_pin_config_t config_input    = {kGPIO_DigitalInput, 0};

    /* Init output ENABLE GPIO. */
    // GPIOA
    GPIO_PinInit(GPIOA, 7U, &config_output_L);
    GPIO_PinInit(GPIOA, 5U, &config_output_L);

    // GPIOB
    GPIO_PinInit(GPIOB, 3U, &config_output_L);

}

void delay(void)
{
	__asm("NOP"); /* delay */
	__asm("NOP"); /* delay */
	__asm("NOP"); /* delay */
	__asm("NOP"); /* delay */
	__asm("NOP"); /* delay */
}

void delay_n(uint16_t time)
{
    volatile uint32_t i = 0;
    for (i = 0; i < time; ++i)
    {
    	delay();
    }
}

/* I2C source clock */
#define I2C_MASTER_CLK_SRC I2C0_CLK_SRC
#define I2C_MASTER_CLK_FREQ CLOCK_GetFreq(I2C0_CLK_SRC)
#define EXAMPLE_I2C_MASTER_BASEADDR I2C0

#define I2C_MASTER_SLAVE_ADDR_7BIT 0x7EU
#define I2C_BAUDRATE 100000U
#define I2C_DATA_LENGTH 33U

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*******************************************************************************
 * Variables
 ******************************************************************************/

uint8_t g_master_txBuff[I2C_DATA_LENGTH];
uint8_t g_master_rxBuff[I2C_DATA_LENGTH];
i2c_master_handle_t g_m_handle;
volatile bool g_MasterCompletionFlag = false;

static void i2c_master_callback(I2C_Type *base, i2c_master_handle_t *handle, status_t status, void *userData)
{
    /* Signal transfer success when received success status. */
    if (status == kStatus_Success)
    {
        g_MasterCompletionFlag = true;
    }
}



#define DEBUG_END
int main(void)
{
    smc_power_state_t curPowerState;
    app_power_mode_t targetPowerMode;
    bool needSetWakeup; /* Need to set wakeup. */
    lptmr_config_t lptmrConfig;

    /* Power related. */
    SMC_SetPowerModeProtection(SMC, kSMC_AllowPowerModeAll);
    if (kRCM_SourceWakeup & RCM_GetPreviousResetSources(RCM)) /* Wakeup from VLLS. */
    {
        PMC_ClearPeriphIOIsolationFlag(PMC);
        NVIC_ClearPendingIRQ(LLWU_IRQn);
    }

#ifndef DEBUG_END
    lpuart_config_t config;
    lpuart_transfer_t xfer;
    lpuart_transfer_t sendXfer;
    lpuart_transfer_t receiveXfer;
    size_t receivedBytes = 0U;
    uint32_t i;

    BOARD_InitPins();
    BOARD_BootClockRUN();
    CLOCK_SetLpuart0Clock(0x1U);

    // gpio init
    user_gpioInit();

    // timer init 1ms
    user_timerInit();


    /*
     * config.baudRate_Bps = 115200U;
     * config.parityMode = kLPUART_ParityDisabled;
     * config.stopBitCount = kLPUART_OneStopBit;
     * config.txFifoWatermark = 0;
     * config.rxFifoWatermark = 0;
     * config.enableTx = false;
     * config.enableRx = false;
     */
    LPUART_GetDefaultConfig(&config);
    config.baudRate_Bps = BOARD_DEBUG_UART_BAUDRATE;
    config.enableTx = true;
    config.enableRx = true;

    LPUART_Init(DEMO_LPUART, &config, DEMO_LPUART_CLK_FREQ);
    LPUART_TransferCreateHandle(DEMO_LPUART, &g_lpuartHandle, LPUART_UserCallback, NULL);
    LPUART_TransferStartRingBuffer(DEMO_LPUART, &g_lpuartHandle, g_rxRingBuffer, RX_RING_BUFFER_SIZE);


    NVIC_EnableIRQ(LLWU_IRQn);
    NVIC_EnableIRQ(APP_WAKEUP_BUTTON_IRQ);

    // enter vlpr
    user_VLPR(&curPowerState, &targetPowerMode,  &needSetWakeup);

    /* Send g_tipString out. */
    xfer.data = g_tipString;
    xfer.dataSize = sizeof(g_tipString) - 1;
    txOnGoing = true;
    LPUART_TransferSendNonBlocking(DEMO_LPUART, &g_lpuartHandle, &xfer);

    /* Wait send finished */
    while (txOnGoing)
    {
    }


    user_showFreq();

    /* Start to echo. */
    sendXfer.data = g_txBuffer;
    sendXfer.dataSize = ECHO_BUFFER_SIZE;
    receiveXfer.data = g_rxBuffer;
    receiveXfer.dataSize = ECHO_BUFFER_SIZE;

    u8 uart_rx[32] = "\0";
    u8 cnt_rx = 0;
    u8 cnt_rx_last = 0;
    u8 cnt_uart_sample = 0;
    u32 cnt_overTime = 0;

    while (1)
    {
        /* If g_txBuffer is empty and g_rxBuffer is full, copy g_rxBuffer to g_txBuffer. */
        if ((!rxBufferEmpty) && (!txBufferFull))
        {
            memcpy(g_txBuffer, g_rxBuffer, ECHO_BUFFER_SIZE);
            rxBufferEmpty = true;
            txBufferFull = true;
        }

        /* If RX is idle and g_rxBuffer is empty, start to read data to g_rxBuffer. */
        if ((!rxOnGoing) && rxBufferEmpty)
        {
            rxOnGoing = true;
            LPUART_TransferReceiveNonBlocking(DEMO_LPUART, &g_lpuartHandle, &receiveXfer, &receivedBytes);
            if (ECHO_BUFFER_SIZE == receivedBytes)
            {
                rxBufferEmpty = false;
                rxOnGoing = false;
            }
//            memcpy(uart_rx + cnt_rx, g_rxBuffer, 1);
            uart_rx[cnt_rx] = g_rxBuffer[0];
            cnt_rx++;
        }

//        if(cnt_uart_sample ++ >= 100)
//        {
//
//        	if(cnt_rx == cnt_rx_last && cnt_rx != 0)
//            {
////        		if(cnt_rx % 6 == 0)
//        		if(cnt_rx >= 6)
//        		{
//        			memcpy(dataBuf, uart_rx, SENSOR_DATA_LEN);
//        			status_rec = REC_SUCCESS;
//        		}
//        		else
//        		{
//        			status_rec = REC_FAIL;
//        		}
//        		cnt_rx = 0;
//            }
//        	cnt_rx_last = cnt_rx;
//        }


        if(STATUS_WAIT_DATA == status)
        {

			if(cnt_rx == 6)
			{
				memcpy(dataBuf, uart_rx, SENSOR_DATA_LEN);
				status_rec = REC_SUCCESS;
				cnt_rx = 0;
				cnt_overTime = 0;
			}
			else if(cnt_rx > 6)
			{
				status_rec = REC_FAIL;
				cnt_rx = 0;
				cnt_overTime = 0;
			}
			else
			{
				cnt_overTime ++ ;
				status_rec = REC_WAIT;
				if(cnt_overTime > 50000) // 6s
				{
					status_rec = REC_FAIL;
					cnt_rx = 0;
					cnt_overTime = 0;
				}
			}
        }
        else
        {
        	cnt_rx = 0;
        	cnt_overTime = 0;
        }


        /* If TX is idle and g_txBuffer is full, start to send data. */
        if ((!txOnGoing) && txBufferFull)
        {
            txOnGoing = true;
            LPUART_TransferSendNonBlocking(DEMO_LPUART, &g_lpuartHandle, &sendXfer);
        }

        if(STATUS_WAIT_TRIG == status)
        {
        	// IDLE
        	GPIO_PinWrite(GPIOB, 3U, 0);

        	GPIO_PinWrite(GPIOA, 5U, 1);
        	delay_n(100); // 2ms
        	GPIO_PinWrite(GPIOA, 5U, 0);

//        	GPIO_PinWrite(GPIOA, 5U, 1);

        	status = STATUS_WAIT_DATA;
        	status_rec = REC_WAIT;
        }

        if(STATUS_WAIT_DATA == status)
        {
        	// IDLE
        	GPIO_PinWrite(GPIOB, 3U, 0);

