Belief997/lab-Micro_power_consumption_backscatter/SDK_2.3.1_MKL03Z32xxx4/boards/frdmkl03z/demo_apps/power_mode_switch/power_mode_switch.c
        	if(REC_SUCCESS == status_rec)
        	{
        		GPIO_PinWrite(GPIOA, 5U, 1);

        		status = STATUS_WAIT_SEND;
				status_rec = REC_WAIT;
        	}
        	else if(REC_FAIL == status_rec)
        	{
        		GPIO_PinWrite(GPIOA, 5U, 1);

        		status = STATUS_WAIT_TRIG;
        		status_rec = REC_WAIT;
        	}
        	else
        	{
        		status = STATUS_WAIT_DATA;
        	}
        }

        if(STATUS_WAIT_SEND == status)
        {
        	if(SEND_SUCCESS == status_send)
        	{
        		status_send = SEND_WAIT;
        		status = STATUS_WAIT_TRIG;
        	}
        	else
        	{
        		status = STATUS_WAIT_SEND;
        	}

        }


    }


#endif


#ifdef DEBUG_END


/******************************************************************************/
    //
    BOARD_InitPins();
    BOARD_I2C_ConfigurePins();
//    user_gpioInit();

    BOARD_BootClockRUN();
    APP_InitDefaultDebugConsole();

    NVIC_EnableIRQ(LLWU_IRQn);
    NVIC_EnableIRQ(APP_WAKEUP_BUTTON_IRQ);

    if (kRCM_SourceWakeup & RCM_GetPreviousResetSources(RCM)) /* Wakeup from VLLS. */
    {
        PRINTF("\r\nMCU wakeup from VLLS modes...\r\n");
    }

// lptmr init
//    user_timerInit();

 // enter vlpr
//    user_VLPR(&curPowerState, &targetPowerMode,  &needSetWakeup);

    // debug: show state to check
//    {
//    	u32 freq;
//        curPowerState = SMC_GetPowerModeState(SMC);
//        freq = CLOCK_GetFreq(kCLOCK_CoreSysClk);
//        APP_ShowPowerMode(curPowerState);
//
//    	  user_showFreqList();
//    }

// pwm init
//    user_pwmInit();

    // iic init
    i2c_master_config_t masterConfig;
    uint32_t sourceClock;
    i2c_master_transfer_t masterXfer;
    PRINTF("\r\nI2C board2board interrupt example -- Master transfer.\r\n");

    /* Set up i2c master to send data to slave*/
    /* First data in txBuff is data length of the transmiting data. */
    g_master_txBuff[0] = I2C_DATA_LENGTH - 1U;
    for (uint32_t i = 1U; i < I2C_DATA_LENGTH; i++)
    {
        g_master_txBuff[i] = i - 1;
    }

    PRINTF("Master will send data :");
    for (uint32_t i = 0U; i < I2C_DATA_LENGTH - 1U; i++)
    {
        if (i % 8 == 0)
        {
            PRINTF("\r\n");
        }
        PRINTF("0x%2x  ", g_master_txBuff[i + 1]);
    }
    PRINTF("\r\n\r\n");

    /*
     * masterConfig->baudRate_Bps = 100000U;
     * masterConfig->enableStopHold = false;
     * masterConfig->glitchFilterWidth = 0U;
     * masterConfig->enableMaster = true;
     */
    I2C_MasterGetDefaultConfig(&masterConfig);
    masterConfig.baudRate_Bps = I2C_BAUDRATE;

    sourceClock = I2C_MASTER_CLK_FREQ;

    I2C_MasterInit(EXAMPLE_I2C_MASTER_BASEADDR, &masterConfig, sourceClock);

    memset(&g_m_handle, 0, sizeof(g_m_handle));
    memset(&masterXfer, 0, sizeof(masterXfer));

    /* subAddress = 0x01, data = g_master_txBuff - write to slave.
      start + slaveaddress(w) + subAddress + length of data buffer + data buffer + stop*/
    uint8_t deviceAddress = 0x01U;
    masterXfer.slaveAddress = I2C_MASTER_SLAVE_ADDR_7BIT;//  <<1
    masterXfer.direction = kI2C_Write;
    masterXfer.subaddress = (uint32_t)deviceAddress;
    masterXfer.subaddressSize = 1;
    masterXfer.data = g_master_txBuff;
    masterXfer.dataSize = I2C_DATA_LENGTH;
    masterXfer.flags = kI2C_TransferDefaultFlag;

    I2C_MasterTransferCreateHandle(EXAMPLE_I2C_MASTER_BASEADDR, &g_m_handle, i2c_master_callback, NULL);
    I2C_MasterTransferNonBlocking(EXAMPLE_I2C_MASTER_BASEADDR, &g_m_handle, &masterXfer);

    /*  Wait for transfer completed. */
    while (!g_MasterCompletionFlag)
    {
    }
    g_MasterCompletionFlag = false;

    while(1)
    {
    	I2C_MasterTransferNonBlocking(EXAMPLE_I2C_MASTER_BASEADDR, &g_m_handle, &masterXfer);
        while (!g_MasterCompletionFlag)
        {
        }
        g_MasterCompletionFlag = false;

        delay_n(99999999);
        PRINTF("MASTER sent data TO slave Once...\r\n");
    }


/******************************************************************************/

    while(1)
    {







    }

    // debug
//    user_showFreqList();

#if WAKEUP_ENABLE
#define SLEEP_CNT 990000
    	u32 debug_cnt = 0;
#endif
        while (1)
        {

#if WAKEUP_ENABLE
            // hold output for about xxx sec

			if(debug_cnt++ > SLEEP_CNT)
			{
				debug_cnt = 0;
				PRINTF("  SLEEP.. \r\n");
				break;
			}
			else if(debug_cnt++ == SLEEP_CNT/2)
			{
				PRINTF("  SLEEP half time pass... \r\n");
            }

#endif

            // debug


        }

#if WAKEUP_ENABLE
    // enter vlls3 mode
    {
        curPowerState = kSMC_PowerStateVlpr;
        targetPowerMode = (app_power_mode_t)kAPP_PowerModeVlls3;
        //needSetWakeup = true;
        APP_GetWakeupConfig(targetPowerMode);
        APP_PowerPreSwitchHook(curPowerState, targetPowerMode);
        APP_SetWakeupConfig(targetPowerMode);
        APP_PowerModeSwitch(curPowerState, targetPowerMode);
        APP_PowerPostSwitchHook(curPowerState, targetPowerMode);
    }
#endif



#endif
    return 0;
}

